Revit 2027 API
ParameterTypeId.StructuralSectionPolygonSides Property
 "Sides"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionPolygonSides { get; }
Public Shared ReadOnly Property StructuralSectionPolygonSides As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionPolygonSides {
	ForgeTypeId^ get ();
}
static member StructuralSectionPolygonSides : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace